data = {
    "kombikorm_parts_list" => [
        { "part" => "Дробилки",
            "type" => [
                "Молотковые дробилки серии TF",
                "Пневматические дробилки сыпучих кормов серии ДСК",
                "Пневматические дробилки с принудительной подачей сырья ДСК",
                "Дробилки КБ"
            ]
        },
        { "part" => "Грануляторы",
            "type" => [
                "Минигрануляторы",
                "Грануляторы с плоской матрицей",
                "Грануляторы с кольцевой матрицей"
            ]
        },
        { "part" => "Весы и весовые устройства",
            "type" => [
                "Весовые устройства",
                "Весы",
                "Упаковшики"
            ]
        },
        { "part" => "Бункер",
            "type" => [
                "Бункер готовой продукции",
                "Бункер демпферный (ворошители)"
            ]
        },
        { "part" => "Система охлаждения",
            "type" => [
                "Блок охлаждения",
                "Колонна охлаждения механическая серии SN-m",
                "Колонна охлаждения серии SK",
                "Колонна охлаждения серии SN"
            ]
        },
        { "part" => "Аспирация",
            "type" => [
                "Бункер аспирации",
                "Циклоны"
            ]
        },
        { "part" => "Смесители",
            "type" => [
                "Смеситель горизонтальный двухвальный серии MD",
                "Смеситель горизонтальный одновальный серии MS",
                "Смеситель кормов вертикальный серии CKB",
                "Бункер подсмесительный с рамой"
            ]
        },
        { "part" => "Экструдеры",
            "type" => [
                "Мини-экструдеры серии EMZ",
                "Экструдеры EXZ",
            ]
        },
        { "part" => "Измельчители",
            "type" => [
                "Измельчитель гранул",
                "Измельчитель рулонов",
            ]
        },
        { "part" => "Система автоматизации",
            "type" => [
                "Пульт управления",
                "Пульт управления гранулятором",
                "Система управления",
                "Шкаф управления КЗ",
                "Комплекс автоматизации для минигрануляторов"
            ]
        },
        { "part" => "Система отопления, обогрева",
            "type" => [
                "Газовые котлы для пара серии ПГ",
                "Дизельные колты для пара серии ПД",
                "Электро-парогенераторы серии ПР"
            ]
        },
        { "part" => "Транспортеры",
            "type" => [
                "Конвейер",
                "Нория",
                "Транспортер",
                "Склад живое дно"
            ]
        },
        { "part" => "Зернопроводы",
            "type" => [
                "Зернопровод d100",
                "Зернопровод d200",
                "Зернопровод d300"
            ]
        },
        { "part" => "Прочее оборудование",
            "type" => [
                "Запорное оборудование",
                "Просеиватель гранул",
                "Прочие",
                "Сепараторы"
            ]
        }
    ],
    "pellet_parts_list" => [
        { "part" => "Дробилки",
            "type" => [
                "Молотковые дробилки серии TF",
                "Пневматические дробилки сыпучих кормов серии ДСК",
                "Пневматические дробилки с принудительной подачей сырья ДСК",
                "Дробилки КБ"
            ]
        },
        { "part" => "Грануляторы",
            "type" => [
                "Минигрануляторы",
                "Грануляторы с плоской матрицей",
                "Грануляторы с кольцевой матрицей"
            ]
        },
        { "part" => "Весы и весовые устройства",
            "type" => [
                "Весовые устройства",
                "Весы",
                "Упаковшики"
            ]
        },
        { "part" => "Бункер",
            "type" => [
                "Бункер готовой продукции",
                "Бункер демпферный (ворошители)"
            ]
        },
        { "part" => "Система охлаждения",
            "type" => [
                "Блок охлаждения",
                "Колонна охлаждения механическая серии SN-m",
                "Колонна охлаждения серии SK",
                "Колонна охлаждения серии SN"
            ]
        },
        { "part" => "Аспирация",
            "type" => [
                "Бункер аспирации",
                "Циклоны"
            ]
        },
        { "part" => "Измельчители",
            "type" => [
                "Измельчитель древесины",
                "Измельчитель рулонов",
                "Щепорзы",
                "Окариватель",
                "Измельчитель бревен"
            ]
        },
        { "part" => "Система автоматизации",
            "type" => [
                "Пульт управления",
                "Пульт управления гранулятором",
                "Система управления",
                "Шкаф управления КЗ",
                "Комплекс автоматизации для минигрануляторов"
            ]
        },
        { "part" => "Система отопления, обогрева",
            "type" => [
                "Парогенератор газовый ПГ",
                "Парогенератор дизельный ПД",
                "Парогенератор пеллетный ПП",
                "Парогенератор электрический ПР",
                "Теплогенератор серии ТГ",
                "Пеллетные котлы"
            ]
        },
        { "part" => "Транспортеры",
            "type" => [
                "Конвейер",
                "Нория",
                "Транспортер",
                "Склад живое дно"
            ]
        },
        { "part" => "Зернопроводы",
            "type" => [
                "Зернопровод d100",
                "Зернопровод d200",
                "Зернопровод d300"
            ]
        },
        { "part" => "Прочее оборудование",
            "type" => [
                "Запорное оборудование",
                "Сушильный комплекс",
                "Пресс-брикетеры",
                "Просеиватель гранул",
                "Прочие",
                "Сепараторы"
            ]
        }
    ]
}


data["kombikorm_parts_list"].each do |part_hash|
  newPart = Part.create(title: part_hash["part"], section: "Комбикормовое оборудование")
  part_hash["type"].each do |type_hash|
    Type.create(part_id: newPart.id, title: type_hash)
  end
end

data["pellet_parts_list"].each do |part_hash|
  newPart = Part.create(title: part_hash["part"], section: "Пеллетное оборудование")
  part_hash["type"].each do |type_hash|
    Type.create(part_id: newPart.id, title: type_hash)
  end
end


About.create(body:
        '<p>Компания &laquo;Крауд НН&raquo; работает на российском рынке более 5 лет.</p>
<p>Главной задачей &laquo;Крауд НН&raquo; является оснащение предприятий сельского хозяйства и перерабатывающей промышленности современным высококачественным оборудованием.</p>
<p>В 2013 году мы открыли новое перспективное направление по производству и поставке оборудования для производства пеллет.</p>
<p>Компания &laquo;КРАУД&raquo; имеет собственные производственные площади, расположенные в г. Нижнем Новгороде и г. Арзамасе.</p>
<p>На производстве задействовано более 300 квалифицированных специалистов. Конструкторский отдел компании имеет возможность разработать схему любой сложности исходя из Ваших потребностей.</p>
<p>Система поставки, пуско-наладочных работ и технического обслуживания оборудования полностью отработана для предприятий различных регионов страны. На складах нашей компании всегда в наличии запасные части и расходные материалы. Благодаря правильно выстроенной цепочке процессов, современному уровню технологии производства, расширенным испытаниям и квалифицированному персоналу мы обеспечиваем выпуск продукции, соответствующий всем требованиям клиентов, а во многом и превосходим ожидания Заказчиков.</p>
')

random_text_list = [
    "Новый стандарт качества",
    "Случайный текст 1",
    "Случайный текст 2",
    "Случайный текст 3",
]

random_text_list.each do |caption|
  Caption.create(body: caption)
end

Admin.create!(id: 1,
    name: "admin",
    email: "admin@yandex.ru",
    password: "foobar",
    password_confirmation: "foobar")

Global.create!(workStart: 8,
           workEnd: 17,
           phone: "+7 831 412-99-90",
           email: "office@kraud.org",
           address: "603105, г. Н. Новгород, <br> ул. Агрономическая, д. 125А",
)